from datetime import datetime

time_now = datetime.now()
today = time_now.strftime('%Y%m%d')  # 날짜


main_menu_str = """
1 : 실시간 전고점 및 5일 거래량 돌파 종목 찾기
3 : 종목 정보 요청
10 : Pandas Test
11 : 실시간 상위 거래량 시작
12 : 텔레그램 테스트
13 : 텔레그램 파일 전송 테스트
21 : 현재 주식 조회
22 : 일별 매매 조회
25 : 전량 매도
99 : 종료
"""

####################
etf = ["ARIRANG", "FOCUS", "HANARO", "KBSTAR", "KINDEX", "KODEX", "KOSEF", "KTOP", "SMART", "TIGER", "ETN", "스팩",
       "TIMEFOLIO"]
xml_data_name = ["시간", "어제 종가", "현재가", "분봉 전가", "상승률", "분봉 변동 금액", "거래급증량"]
bot_token = "1801941374:AAFWlXnwjnDs7YzfgW2VCbcu_yuu_2x8HZ8"
solo_id = "1822420422"
group_id = "-1001494510254"
account_num = "8001018511"
password = ""

opt10001 = [["종목코드"],
            ["unknown"],
            ["250최고", "250최저", "시가총액", "PER", "매출액", "영업이익", "당기순이익", "시가", "고가", "저가", "현재가",
             "전일대비", "등락율", "거래량"]]

opt10080 = [["종목코드", "틱범위", "수정주가구분"],
            ["unknown", "unknown", "1"],
            ["현재가"]]

opt10023 = [["시장구분", "정렬구분","시간구분", "거래량구분", "시간", "종목조건", "가격구분"],
            ["000", "2", "1", "10", "unknown", "0", "0"],
            ["종목코드", "종목명", "현재가", "전일대비기호", "전일대비", "이전거래량", "현재거래량", "급증량", "급증률", "등락률"]]

opt10016 = [["시장구분", "신고저구분", "고저종구분", "종목조건", "거래량구분", "신용조건", "상하한포함", "기간"],
            ["000", "1", "2", "0", "00000", "0", "1", "60"],
            ["종목코드", "종목명", "등락률", "현재가"]]

opt10024 = [["시장구분", "주기구분", "거래량구분"],
            ["000", "5", "5"],
            ["종목코드", "종목명", "현재가", "전일대비"]]

OPW00003 = [["계좌번호", "비밀번호", "상장폐지조회구분"],
            [account_num, password, "0"],
            ["추정예탁자산"]]

OPW00004 = [["계좌번호", "비밀번호", "비밀번호입력매체구분", "조회구분"],
            [account_num, password, "00", "1"],
            ["예탁자산평가액", "당일손익율", "종목코드", "종목명", "보유수량", "평균단가", "현재가", "평가금액", "손익금액",
             "손익율", "매입금액", "출력건수"]]

OPW00007 = [["주문일자", "계좌번호", "비밀번호", "비밀번호입력매체구분", "조회구분", "주식채권구분", "매도수구분", "종목코드", "시작주문번호"],
            [today, account_num, password, "00", "4", "1", "0", "", ""],
            ["확인시간", "종목명", "주문구분", "체결수량", "체결단가"]]

"""
8165838111
"""